; domain
(define (domain delivery)
    (:requirements :typing :equality :negative-preconditions :constraints)
    (:types
        cell - object
        locatable - object
        package - locatable
        truck - locatable
    )

    (:predicates
        (at ?x1 - locatable ?x2 - cell)
        (carrying ?x1 - truck ?x2 - package)
        (empty ?x1 - truck)
        (adjacent ?x1 - cell ?x2 - cell)
    )

    (:action pick-package
     :parameters (?t - truck ?p - package ?x - cell)
     :precondition (and (at ?p ?x) (at ?t ?x) (empty ?t))
     :effect (and
        (not (at ?p ?x))
        (not (empty ?t))
        (carrying ?t ?p))
    )

    (:action drop-package
     :parameters (?t - truck ?p - package ?x - cell)
     :precondition (and (at ?t ?x) (carrying ?t ?p))
     :effect (and
        (empty ?t)
        (not (carrying ?t ?p))
        (at ?p ?x))
    )

    (:action move
     :parameters (?t - truck ?from - cell ?to - cell)
     :precondition (and (adjacent ?from ?to) (at ?t ?from) (not (= ?from ?to)))
     :effect (and
        (not (at ?t ?from))
        (at ?t ?to))
    )
)

; problem
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Instance file automatically generated by the Tarski FSTRIPS writer
;;; 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (problem delivery-3x3-2-1548293233)
    (:domain delivery)

    (:objects
        c_0_0 c_0_1 c_0_2 c_1_0 c_1_1 c_1_2 c_2_0 c_2_1 c_2_2 - cell
        p1 p2 - package
        t1 - truck
    )

    (:init
        (adjacent c_1_1 c_1_2)
        (adjacent c_2_2 c_1_2)
        (adjacent c_0_1 c_1_1)
        (adjacent c_0_1 c_0_0)
        (adjacent c_1_1 c_0_1)
        (adjacent c_0_0 c_0_1)
        (adjacent c_0_2 c_1_2)
        (adjacent c_1_1 c_2_1)
        (adjacent c_2_2 c_2_1)
        (adjacent c_1_1 c_1_0)
        (adjacent c_0_0 c_1_0)
        (adjacent c_2_1 c_1_1)
        (adjacent c_0_2 c_0_1)
        (adjacent c_1_0 c_2_0)
        (adjacent c_1_2 c_2_2)
        (adjacent c_1_2 c_0_2)
        (adjacent c_0_1 c_0_2)
        (adjacent c_2_1 c_2_0)
        (adjacent c_1_2 c_1_1)
        (adjacent c_2_0 c_2_1)
        (adjacent c_2_1 c_2_2)
        (adjacent c_1_0 c_1_1)
        (adjacent c_2_0 c_1_0)
        (adjacent c_1_0 c_0_0)
        (at p2 c_1_2)
        (at p1 c_1_1)
        (at t1 c_1_2)
        (empty t1)
    )

    (:goal
        (and (at p1 c_0_1) (at p2 c_0_1))
    )

    
    
    
)

; plan
1. (move t1 c_1_2 c_1_1)
   deleted: (at t1 c_1_2)
   added: (at t1 c_1_1)
   goals met: 0 of 2
2. (pick-package t1 p1 c_1_1)
   deleted: (at p1 c_1_1) (empty t1)
   added: (carrying t1 p1)
   goals met: 0 of 2
3. (move t1 c_1_1 c_0_1)
   deleted: (at t1 c_1_1)
   added: (at t1 c_0_1)
   goals met: 0 of 2
4. (drop-package t1 p1 c_0_1)
   deleted: (carrying t1 p1)
   added: (empty t1) (at p1 c_0_1)
   goals met: 1 of 2
5. (move t1 c_0_1 c_0_2)
   deleted: (at t1 c_0_1)
   added: (at t1 c_0_2)
   goals met: 1 of 2
6. (move t1 c_0_2 c_1_2)
   deleted: (at t1 c_0_2)
   added: (at t1 c_1_2)
   goals met: 1 of 2
7. (pick-package t1 p2 c_1_2)
   deleted: (at p2 c_1_2) (empty t1)
   added: (carrying t1 p2)
   goals met: 1 of 2
8. (move t1 c_1_2 c_0_2)
   deleted: (at t1 c_1_2)
   added: (at t1 c_0_2)
   goals met: 1 of 2
9. (move t1 c_0_2 c_0_1)
   deleted: (at t1 c_0_2)
   added: (at t1 c_0_1)
   goals met: 1 of 2
10. (drop-package t1 p2 c_0_1)
   deleted: (carrying t1 p2)
   added: (empty t1) (at p2 c_0_1)
   goals met: 2 of 2
